app/controllers/things_controller.rb

SELECT "things".* FROM "things"
---
    def index
        render jsonapi: Thing.all, include: [:child_things]

SELECT "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        render jsonapi: Thing.find(params[:id])

INSERT INTO "things" ("name", "content", "url", "image_url", "is_favorite", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        thing = Thing.new(thing_params)
        if thing.save

SELECT "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "things" SET "image_url" = $1, "updated_at" = $2 WHERE "things"."id" = $3  [["image_url", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Flask_logo.svg/1200px-Flask_logo.svg.png"], ["updated_at", "2022-07-26 22:17:23.507095"], ["id", 4]]
---
    def update
        thing = Thing.find(params[:id])
        if thing.update(thing_params)

DELETE FROM "things" WHERE "things"."id" = $1  [["id", 5]]
SELECT "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def destroy
        Thing.find(params[:id]).destroy