app/controllers/thing_relationships_controller.rb

    def index
        render jsonapi: ThingRelationship.all
---
SELECT "thing_relationships".* FROM "thing_relationships"

    def show
        render jsonapi: ThingRelationship.find(params[:id])
---
SELECT "thing_relationships".* FROM "thing_relationships" WHERE "thing_relationships"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        thing_relationship = ThingRelationship.new(thing_relationship_params)
        if thing_relationship.save
---
INSERT INTO "thing_relationships" ("parent_thing_id", "child_thing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["parent_thing_id", 2], ["child_thing_id", 3], ["created_at", "2022-07-26 22:41:06.978815"], ["updated_at", "2022-07-26 22:41:06.978815"]]

    def destroy
        ThingRelationship.find(params[:id]).destroy
---
DELETE FROM "thing_relationships" WHERE "thing_relationships"."id" = $1  [["id", 2]]
SELECT "thing_relationships".* FROM "thing_relationships" WHERE "thing_relationships"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]